Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00064.PIC
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x42002854"/>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="PATTBUF" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x42002864">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="PGEB0" edc:nzwidth="0x1" edc:desc="Pattern Generation 0 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB1" edc:nzwidth="0x1" edc:desc="Pattern Generation 1 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB2" edc:nzwidth="0x1" edc:desc="Pattern Generation 2 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB3" edc:nzwidth="0x1" edc:desc="Pattern Generation 3 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB4" edc:nzwidth="0x1" edc:desc="Pattern Generation 4 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB5" edc:nzwidth="0x1" edc:desc="Pattern Generation 5 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB6" edc:nzwidth="0x1" edc:desc="Pattern Generation 6 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGEB7" edc:nzwidth="0x1" edc:desc="Pattern Generation 7 Output Enable Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB0" edc:nzwidth="0x1" edc:desc="Pattern Generation 0 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB1" edc:nzwidth="0x1" edc:desc="Pattern Generation 1 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB2" edc:nzwidth="0x1" edc:desc="Pattern Generation 2 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB3" edc:nzwidth="0x1" edc:desc="Pattern Generation 3 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB4" edc:nzwidth="0x1" edc:desc="Pattern Generation 4 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB5" edc:nzwidth="0x1" edc:desc="Pattern Generation 5 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB6" edc:nzwidth="0x1" edc:desc="Pattern Generation 6 Output Value Buffer"/>
            <edc:SFRFieldDef edc:cname="PGVB7" edc:nzwidth="0x1" edc:desc="Pattern Generation 7 Output Value Buffer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x42002866"/>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="PERBUF" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:impl="0xFFFFFF" edc:_addr="0x4200286C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="PERBUF" edc:nzwidth="0x18" edc:desc="Period Buffer Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:nzwidth="0x14" edc:desc="Period Buffer Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:nzwidth="0x13" edc:desc="Period Buffer Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:nzwidth="0x12" edc:desc="Period Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="CCBUF0" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42002870">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x18" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x14" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x13" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x12" edc:desc="Channel Compare/Capture Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="CCBUF1" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42002874">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x18" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x14" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x13" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x12" edc:desc="Channel Compare/Capture Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="CCBUF2" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42002878">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x18" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x14" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x13" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x12" edc:desc="Channel Compare/Capture Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="CCBUF3" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x4200287C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x18" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x14" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x13" edc:desc="Channel Compare/Capture Buffer Value"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:nzwidth="0x12" edc:desc="Channel Compare/Capture Buffer Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x380" edc:_addr="0x42002880"/>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="CTRLA" edc:nzwidth="0x20" edc:access="----nnnnn------nnnnnnnnn-nn---nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF81FF63" edc:_addr="0x42002C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RESOLUTION" edc:nzwidth="0x2" edc:desc="Enhanced Resolution">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Dithering is disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DITH4" edc:desc="Dithering is done every 16 PWM frames" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DITH5" edc:desc="Dithering is done every 32 PWM frames" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DITH6" edc:desc="Dithering is done every 64 PWM frames" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0x3" edc:desc="Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="No division" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide by 64" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide by 256" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide by 1024" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="PRESCSYNC" edc:nzwidth="0x2" edc:desc="Prescaler and Counter Synchronization Selection">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Reload or reset counter on next GCLK" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESC" edc:desc="Reload or reset counter on next prescaler clock" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RESYNC" edc:desc="Reload or reset counter on next GCLK and reset prescaler counter" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALOCK" edc:nzwidth="0x1" edc:desc="Auto Lock"/>
            <edc:SFRFieldDef edc:cname="MSYNC" edc:nzwidth="0x1" edc:desc="Master Synchronization (only for TCC Slave Instance)"/>
            <edc:SFRFieldDef edc:cname="FCYCLE" edc:nzwidth="0x1" edc:desc="Full Cycle"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DMAOS" edc:nzwidth="0x1" edc:desc="DMA One-shot Trigger Mode"/>
            <edc:SFRFieldDef edc:cname="CPTEN0" edc:nzwidth="0x1" edc:desc="Capture Channel 0 Enable"/>
            <edc:SFRFieldDef edc:cname="CPTEN1" edc:nzwidth="0x1" edc:desc="Capture Channel 1 Enable"/>
            <edc:SFRFieldDef edc:cname="CPTEN2" edc:nzwidth="0x1" edc:desc="Capture Channel 2 Enable"/>
            <edc:SFRFieldDef edc:cname="CPTEN3" edc:nzwidth="0x1" edc:desc="Capture Channel 3 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="CTRLBCLR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x42002C04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Counter Direction"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:nzwidth="0x1" edc:desc="Lock Update"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:nzwidth="0x1" edc:desc="One-Shot"/>
            <edc:SFRFieldDef edc:cname="IDXCMD" edc:nzwidth="0x2" edc:desc="Ramp Index Command">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Command disabled: Index toggles between cycles A and B" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set index: cycle B will be forced in the next cycle" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="Clear index: cycle A will be forced in the next cycle" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="Hold index: the next cycle will be the same as the current cycle" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x3" edc:desc="TCC Command">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Clear start, restart or retrigger" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force stop" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force update or double buffered registers" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="READSYNC" edc:desc="Force COUNT read synchronization" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DMAOS" edc:desc="One-shot DMA trigger" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="CTRLBSET" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x42002C05">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Counter Direction"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:nzwidth="0x1" edc:desc="Lock Update"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:nzwidth="0x1" edc:desc="One-Shot"/>
            <edc:SFRFieldDef edc:cname="IDXCMD" edc:nzwidth="0x2" edc:desc="Ramp Index Command">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Command disabled: Index toggles between cycles A and B" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set index: cycle B will be forced in the next cycle" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="Clear index: cycle A will be forced in the next cycle" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="Hold index: the next cycle will be the same as the current cycle" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x3" edc:desc="TCC Command">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Clear start, restart or retrigger" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force stop" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force update or double buffered registers" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="READSYNC" edc:desc="Force COUNT read synchronization" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DMAOS" edc:desc="One-shot DMA trigger" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x42002C06"/>
      <edc:SFRDef ltx:memberofperipheral="TCC1" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="--------------------rrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x42002C08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC1">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Swrst Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable Busy"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:nzwidth="0x1" edc:desc="Ctrlb Busy"/>
            <edc:SFRFieldDef edc:cname="STATUS" edc:nzwidth="0x1" edc:desc="Status Busy"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x1" edc:desc="Count Busy"/>
            <edc:SFRFieldDef edc:cname="PATT" edc:nzwidth="0x1" edc:desc="Pattern Busy"/>
            <edc:SFRFieldDef edc:cname="WAVE" edc:nzwidth="0x1" edc:desc="Wave Busy"/>
            <edc:SFRFieldDef edc:cname="PER" edc:nzwidth="0x1" edc:desc="Period Busy"/>
            <edc:SFRFieldDef edc:cname="CC0" edc:nzwidth="0x1" edc:desc="Compare Channel 0 Busy"/>
            <edc:SFRFieldDef edc:cname="CC1" edc:nzwidth="0x1" edc:desc="Compare Channel 1 Busy"/>
            <edc:SFRFieldDef edc:cname="CC2" edc:nzwidth="0x1" edc:desc="Compare Channel 2 Busy"/>
            <edc:SFRFieldDef edc:cname="CC3" edc:nzwidth="0x1" edc:desc="Compare Channel 3 Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
