Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00064.PIC
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="GAINCORR" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFFF" edc:_addr="0x42003812">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:nzwidth="0xC" edc:desc="Gain Correction Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="OFFSETCORR" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFFF" edc:_addr="0x42003814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:nzwidth="0xC" edc:desc="Offset Correction Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x42003816"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="SWTRIG" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x42003818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="FLUSH" edc:nzwidth="0x1" edc:desc="ADC Flush"/>
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Start ADC Conversion"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x42003819"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x4200381C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug Run"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x4200381D"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="SYNCBUSY" edc:nzwidth="0x10" edc:access="-----rrrrrrrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x7FF" edc:_addr="0x42003820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="SWRST Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ENABLE Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="INPUTCTRL" edc:nzwidth="0x1" edc:desc="INPUTCTRL Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="CTRLC" edc:nzwidth="0x1" edc:desc="CTRLC Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="AVGCTRL" edc:nzwidth="0x1" edc:desc="AVGCTRL Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="SAMPCTRL" edc:nzwidth="0x1" edc:desc="SAMPCTRL Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="WINLT" edc:nzwidth="0x1" edc:desc="WINLT Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="WINUT" edc:nzwidth="0x1" edc:desc="WINUT Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:nzwidth="0x1" edc:desc="GAINCORR Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:nzwidth="0x1" edc:desc="OFFSETCTRL Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="SWTRIG" edc:nzwidth="0x1" edc:desc="SWTRG Synchronization Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x42003822"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="RESULT" edc:nzwidth="0x10" edc:access="rrrrrrrrrrrrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x42003824">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="RESULT" edc:nzwidth="0x10" edc:desc="Result Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x42003826"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="SEQCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42003828">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="SEQEN" edc:nzwidth="0x20" edc:desc="Enable Positive Input in the Sequence"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="CALIB" edc:nzwidth="0x10" edc:access="-----nnn-----nnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x707" edc:_addr="0x4200382C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="BIASCOMP" edc:nzwidth="0x3" edc:desc="Bias Comparator Scaling"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BIASREFBUF" edc:nzwidth="0x3" edc:desc="Bias Reference Buffer Scaling"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3D2" edc:_addr="0x4200382E"/>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x42003C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable DAC Controller"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
