Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00064.PIC
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x42004C01"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="CLKCTRL0" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3FFFFF" edc:_addr="0x42004C04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SLOTSIZE" edc:nzwidth="0x2" edc:desc="Slot Size">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSLOTS" edc:nzwidth="0x3" edc:desc="Number of Slots in Frame"/>
            <edc:SFRFieldDef edc:cname="FSWIDTH" edc:nzwidth="0x2" edc:desc="Frame Sync Width">
              <edc:SFRFieldSemantic edc:cname="SLOT" edc:desc="Frame Sync Pulse is 1 Slot wide (default for I2S protocol)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Frame Sync Pulse is half a Frame wide" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BIT" edc:desc="Frame Sync Pulse is 1 Bit wide" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BURST" edc:desc="Clock Unit n operates in Burst mode, with a 1-bit wide Frame Sync pulse per Data sample, only when Data transfer is requested" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BITDELAY" edc:nzwidth="0x1" edc:desc="Data Delay from Frame Sync">
              <edc:SFRFieldSemantic edc:cname="LJ" edc:desc="Left Justified (0 Bit Delay)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="I2S" edc:desc="I2S (1 Bit Delay)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSSEL" edc:nzwidth="0x1" edc:desc="Frame Sync Select">
              <edc:SFRFieldSemantic edc:cname="SCKDIV" edc:desc="Divided Serial Clock n is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FSPIN" edc:desc="FSn input pin is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSINV" edc:nzwidth="0x1" edc:desc="Frame Sync Invert"/>
            <edc:SFRFieldDef edc:cname="FSOUTINV" edc:nzwidth="0x1" edc:desc="Frame Sync Output Invert"/>
            <edc:SFRFieldDef edc:cname="SCKSEL" edc:nzwidth="0x1" edc:desc="Serial Clock Select">
              <edc:SFRFieldSemantic edc:cname="MCKDIV" edc:desc="Divided Master Clock n is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SCKPIN" edc:desc="SCKn input pin is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCKOUTINV" edc:nzwidth="0x1" edc:desc="Serial Clock Output Invert"/>
            <edc:SFRFieldDef edc:cname="MCKSEL" edc:nzwidth="0x1" edc:desc="Master Clock Select">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK_I2S_n is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCKPIN" edc:desc="MCKn input pin is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MCKEN" edc:nzwidth="0x1" edc:desc="Master Clock Enable"/>
            <edc:SFRFieldDef edc:cname="MCKOUTINV" edc:nzwidth="0x1" edc:desc="Master Clock Output Invert"/>
            <edc:SFRFieldDef edc:cname="MCKDIV" edc:nzwidth="0x6" edc:desc="Master Clock Division Factor"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MCKOUTDIV" edc:nzwidth="0x6" edc:desc="Master Clock Output Division Factor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="CLKCTRL1" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3FFFFF" edc:_addr="0x42004C08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="SLOTSIZE" edc:nzwidth="0x2" edc:desc="Slot Size">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32-bit Slot for Clock Unit n" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSLOTS" edc:nzwidth="0x3" edc:desc="Number of Slots in Frame"/>
            <edc:SFRFieldDef edc:cname="FSWIDTH" edc:nzwidth="0x2" edc:desc="Frame Sync Width">
              <edc:SFRFieldSemantic edc:cname="SLOT" edc:desc="Frame Sync Pulse is 1 Slot wide (default for I2S protocol)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Frame Sync Pulse is half a Frame wide" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BIT" edc:desc="Frame Sync Pulse is 1 Bit wide" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BURST" edc:desc="Clock Unit n operates in Burst mode, with a 1-bit wide Frame Sync pulse per Data sample, only when Data transfer is requested" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BITDELAY" edc:nzwidth="0x1" edc:desc="Data Delay from Frame Sync">
              <edc:SFRFieldSemantic edc:cname="LJ" edc:desc="Left Justified (0 Bit Delay)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="I2S" edc:desc="I2S (1 Bit Delay)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSSEL" edc:nzwidth="0x1" edc:desc="Frame Sync Select">
              <edc:SFRFieldSemantic edc:cname="SCKDIV" edc:desc="Divided Serial Clock n is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FSPIN" edc:desc="FSn input pin is used as Frame Sync n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FSINV" edc:nzwidth="0x1" edc:desc="Frame Sync Invert"/>
            <edc:SFRFieldDef edc:cname="FSOUTINV" edc:nzwidth="0x1" edc:desc="Frame Sync Output Invert"/>
            <edc:SFRFieldDef edc:cname="SCKSEL" edc:nzwidth="0x1" edc:desc="Serial Clock Select">
              <edc:SFRFieldSemantic edc:cname="MCKDIV" edc:desc="Divided Master Clock n is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SCKPIN" edc:desc="SCKn input pin is used as Serial Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCKOUTINV" edc:nzwidth="0x1" edc:desc="Serial Clock Output Invert"/>
            <edc:SFRFieldDef edc:cname="MCKSEL" edc:nzwidth="0x1" edc:desc="Master Clock Select">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK_I2S_n is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCKPIN" edc:desc="MCKn input pin is used as Master Clock n source" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MCKEN" edc:nzwidth="0x1" edc:desc="Master Clock Enable"/>
            <edc:SFRFieldDef edc:cname="MCKOUTINV" edc:nzwidth="0x1" edc:desc="Master Clock Output Invert"/>
            <edc:SFRFieldDef edc:cname="MCKDIV" edc:nzwidth="0x6" edc:desc="Master Clock Division Factor"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MCKOUTDIV" edc:nzwidth="0x6" edc:desc="Master Clock Output Division Factor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="INTENCLR" edc:nzwidth="0x10" edc:access="--nn--nn--nn--nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3333" edc:_addr="0x42004C0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="RXRDY0" edc:nzwidth="0x1" edc:desc="Receive Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXRDY1" edc:nzwidth="0x1" edc:desc="Receive Ready 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR0" edc:nzwidth="0x1" edc:desc="Receive Overrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOR1" edc:nzwidth="0x1" edc:desc="Receive Overrun 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:nzwidth="0x1" edc:desc="Transmit Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:nzwidth="0x1" edc:desc="Transmit Ready 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXUR0" edc:nzwidth="0x1" edc:desc="Transmit Underrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXUR1" edc:nzwidth="0x1" edc:desc="Transmit Underrun 1 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x42004C0E"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="INTENSET" edc:nzwidth="0x10" edc:access="--nn--nn--nn--nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3333" edc:_addr="0x42004C10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="RXRDY0" edc:nzwidth="0x1" edc:desc="Receive Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXRDY1" edc:nzwidth="0x1" edc:desc="Receive Ready 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR0" edc:nzwidth="0x1" edc:desc="Receive Overrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOR1" edc:nzwidth="0x1" edc:desc="Receive Overrun 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:nzwidth="0x1" edc:desc="Transmit Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:nzwidth="0x1" edc:desc="Transmit Ready 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXUR0" edc:nzwidth="0x1" edc:desc="Transmit Underrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXUR1" edc:nzwidth="0x1" edc:desc="Transmit Underrun 1 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x42004C12"/>
      <edc:SFRDef ltx:memberofperipheral="I2S" edc:cname="INTFLAG" edc:nzwidth="0x10" edc:access="--nn--nn--nn--nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3333" edc:_addr="0x42004C14">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2S">
            <edc:SFRFieldDef edc:cname="RXRDY0" edc:nzwidth="0x1" edc:desc="Receive Ready 0"/>
            <edc:SFRFieldDef edc:cname="RXRDY1" edc:nzwidth="0x1" edc:desc="Receive Ready 1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR0" edc:nzwidth="0x1" edc:desc="Receive Overrun 0"/>
            <edc:SFRFieldDef edc:cname="RXOR1" edc:nzwidth="0x1" edc:desc="Receive Overrun 1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY0" edc:nzwidth="0x1" edc:desc="Transmit Ready 0"/>
            <edc:SFRFieldDef edc:cname="TXRDY1" edc:nzwidth="0x1" edc:desc="Transmit Ready 1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXUR0" edc:nzwidth="0x1" edc:desc="Transmit Underrun 0"/>
            <edc:SFRFieldDef edc:cname="TXUR1" edc:nzwidth="0x1" edc:desc="Transmit Underrun 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
