Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00064.PIC
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E41C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR8" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR9" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR10" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E428">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E42C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NVIC_NS" edc:cname="NVIC_NS_IPR13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE002E434">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC_NS">
            <edc:SFRFieldDef edc:cname="PRI_N0" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+0"/>
            <edc:SFRFieldDef edc:cname="PRI_N1" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+1"/>
            <edc:SFRFieldDef edc:cname="PRI_N2" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+2"/>
            <edc:SFRFieldDef edc:cname="PRI_N3" edc:nzwidth="0x8" edc:desc="Priority of interrupt number 4n+3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
