Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00064.PIC
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="TIMESTAMP" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x40002464">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x20" edc:desc="Count Timestamp Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="RTC/MODE1">
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="CTRLA" edc:nzwidth="0x10" edc:access="nn--nnnn----nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xCF0F" edc:addr="0x40002400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x2" edc:desc="Operating Mode">
              <edc:SFRFieldSemantic edc:cname="COUNT32" edc:desc="Mode 0: 32-bit Counter" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="COUNT16" edc:desc="Mode 1: 16-bit Counter" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CLOCK" edc:desc="Mode 2: Clock/Calendar" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0x4" edc:desc="Prescaler">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="CLK_RTC_CNT = GCLK_RTC/1" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="CLK_RTC_CNT = GCLK_RTC/1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_RTC_CNT = GCLK_RTC/2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_RTC_CNT = GCLK_RTC/4" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_RTC_CNT = GCLK_RTC/8" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_RTC_CNT = GCLK_RTC/16" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_RTC_CNT = GCLK_RTC/32" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_RTC_CNT = GCLK_RTC/64" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_RTC_CNT = GCLK_RTC/128" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_RTC_CNT = GCLK_RTC/256" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="CLK_RTC_CNT = GCLK_RTC/512" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="CLK_RTC_CNT = GCLK_RTC/1024" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GPTRST" edc:nzwidth="0x1" edc:desc="GP Registers Reset On Tamper Enable"/>
            <edc:SFRFieldDef edc:cname="COUNTSYNC" edc:nzwidth="0x1" edc:desc="Count Read Synchronization Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="CTRLB" edc:nzwidth="0x10" edc:access="nnnn-nnnnnnn---n" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF7F1" edc:addr="0x40002402">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="GP0EN" edc:nzwidth="0x1" edc:desc="General Purpose 0 Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DEBMAJ" edc:nzwidth="0x1" edc:desc="Debouncer Majority Enable"/>
            <edc:SFRFieldDef edc:cname="DEBASYNC" edc:nzwidth="0x1" edc:desc="Debouncer Asynchronous Enable"/>
            <edc:SFRFieldDef edc:cname="RTCOUT" edc:nzwidth="0x1" edc:desc="RTC Output Enable"/>
            <edc:SFRFieldDef edc:cname="DMAEN" edc:nzwidth="0x1" edc:desc="DMA Enable"/>
            <edc:SFRFieldDef edc:cname="DEBF" edc:nzwidth="0x3" edc:desc="Debounce Frequency">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_RTC_DEB = CLK_RTC/2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_RTC_DEB = CLK_RTC/4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_RTC_DEB = CLK_RTC/8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_RTC_DEB = CLK_RTC/16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_RTC_DEB = CLK_RTC/32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_RTC_DEB = CLK_RTC/64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_RTC_DEB = CLK_RTC/128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_RTC_DEB = CLK_RTC/256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTF" edc:nzwidth="0x3" edc:desc="Active Layer Frequency">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_RTC_OUT = CLK_RTC/2" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_RTC_OUT = CLK_RTC/4" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_RTC_OUT = CLK_RTC/8" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_RTC_OUT = CLK_RTC/16" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_RTC_OUT = CLK_RTC/32" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_RTC_OUT = CLK_RTC/64" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_RTC_OUT = CLK_RTC/128" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_RTC_OUT = CLK_RTC/256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SEPTO" edc:nzwidth="0x1" edc:desc="Separate Tamper Outputs"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
