Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00064.PIC
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="n--nn-nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x9B" edc:addr="0x42001818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="MB" edc:nzwidth="0x1" edc:desc="Master On Bus Interrupt"/>
            <edc:SFRFieldDef edc:cname="SB" edc:nzwidth="0x1" edc:desc="Slave On Bus Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXFE" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXFF" edc:nzwidth="0x1" edc:desc="Rx FIFO Full Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:nzwidth="0x1" edc:desc="Combined Error Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="STATUS" edc:nzwidth="0x10" edc:access="-----nnnnnnn-nnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x7F7" edc:addr="0x4200181A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="BUSERR" edc:nzwidth="0x1" edc:desc="Bus Error"/>
            <edc:SFRFieldDef edc:cname="ARBLOST" edc:nzwidth="0x1" edc:desc="Arbitration Lost"/>
            <edc:SFRFieldDef edc:cname="RXNACK" edc:nzwidth="0x1" edc:desc="Received Not Acknowledge"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSSTATE" edc:nzwidth="0x2" edc:desc="Bus State">
              <edc:SFRFieldSemantic edc:cname="UNKNOWN" edc:desc="Wait for stop or idle" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Wait for transaction initialization" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OWNER" edc:desc="I2C master is the current owner of the bus" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BUSY" edc:desc="Some other I2C master owns the bus" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOWTOUT" edc:nzwidth="0x1" edc:desc="SCL Low Timeout"/>
            <edc:SFRFieldDef edc:cname="CLKHOLD" edc:nzwidth="0x1" edc:desc="Clock Hold"/>
            <edc:SFRFieldDef edc:cname="MEXTTOUT" edc:nzwidth="0x1" edc:desc="Master SCL Low Extend Timeout"/>
            <edc:SFRFieldDef edc:cname="SEXTTOUT" edc:nzwidth="0x1" edc:desc="Slave SCL Low Extend Timeout"/>
            <edc:SFRFieldDef edc:cname="LENERR" edc:nzwidth="0x1" edc:desc="Length Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:addr="0x4200181C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="SERCOM Enable Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="SYSOP" edc:nzwidth="0x1" edc:desc="System Operation Synchronization Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="ADDR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnn--nnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFE7FF" edc:addr="0x42001824">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0xB" edc:desc="Address Value"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LENEN" edc:nzwidth="0x1" edc:desc="Length Enable"/>
            <edc:SFRFieldDef edc:cname="HS" edc:nzwidth="0x1" edc:desc="High Speed Mode"/>
            <edc:SFRFieldDef edc:cname="TENBITEN" edc:nzwidth="0x1" edc:desc="Ten Bit Addressing Enable"/>
            <edc:SFRFieldDef edc:cname="LEN" edc:nzwidth="0x8" edc:desc="Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="DATA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x42001828">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:addr="0x42001830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DBGSTOP" edc:nzwidth="0x1" edc:desc="Debug Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="FIFOSPACE" edc:nzwidth="0x10" edc:access="---rrrrr---rrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x1F1F" edc:addr="0x42001834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="TXSPACE" edc:nzwidth="0x5" edc:desc="Tx FIFO Empty Space"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RXSPACE" edc:nzwidth="0x5" edc:desc="Rx FIFO Filled Space"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="FIFOPTR" edc:nzwidth="0x10" edc:access="----nnnn----nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF0F" edc:addr="0x42001836">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="CPUWRPTR" edc:nzwidth="0x4" edc:desc="CPU FIFO Write Pointer"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CPURDPTR" edc:nzwidth="0x4" edc:desc="CPU FIFO Read Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="SERCOM5/I2CS">
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="CTRLA" edc:nzwidth="0x20" edc:access="-n--n-nnn-nn---n--------n--nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x4BB1009F" edc:addr="0x42001800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x3" edc:desc="Operating Mode">
              <edc:SFRFieldSemantic edc:cname="I2C_SLAVE" edc:desc="I2C slave operation" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PINOUT" edc:nzwidth="0x1" edc:desc="Pin Usage"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDAHOLD" edc:nzwidth="0x2" edc:desc="SDA Hold Time">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="75NS" edc:desc="50-100ns hold time" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="450NS" edc:desc="300-600ns hold time" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="600NS" edc:desc="400-800ns hold time" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SEXTTOEN" edc:nzwidth="0x1" edc:desc="Slave SCL Low Extend Timeout"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:nzwidth="0x2" edc:desc="Transfer Speed">
              <edc:SFRFieldSemantic edc:cname="SM" edc:desc="Standard-Mode (SM) and Fast-Mode (FM)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FMP" edc:desc="Fast-Mode Plus (FM+)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HS" edc:desc="High-Speed Mode" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCLSM" edc:nzwidth="0x1" edc:desc="SCL Clock Stretch Mode"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LOWTOUTEN" edc:nzwidth="0x1" edc:desc="SCL Low Timeout Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="CTRLB" edc:nzwidth="0x20" edc:access="--------nn---nnnnn---nnn--------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xC7C700" edc:addr="0x42001804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:nzwidth="0x1" edc:desc="Smart Mode Enable"/>
            <edc:SFRFieldDef edc:cname="GCMD" edc:nzwidth="0x1" edc:desc="PMBus Group Command"/>
            <edc:SFRFieldDef edc:cname="AACKEN" edc:nzwidth="0x1" edc:desc="Automatic Address Acknowledge"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AMODE" edc:nzwidth="0x2" edc:desc="Address Mode">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="The slave responds to the address written in ADDR.ADDR masked by the value in ADDR.ADDRMASK" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2ADDRS" edc:desc="The slave responds to the two unique addresses in ADDR and ADDRMASK" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RANGE" edc:desc="The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x2" edc:desc="Command"/>
            <edc:SFRFieldDef edc:cname="ACKACT" edc:nzwidth="0x1" edc:desc="Acknowledge Action"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FIFOCLR" edc:nzwidth="0x2" edc:desc="FIFO Clear">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TXFIFO" edc:desc="Clear TX FIFO" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RXFIFO" edc:desc="Clear RX FIFO" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Clear both TX and RF FIFOs" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="CTRLC" edc:nzwidth="0x20" edc:access="nnnnn--n--------------------nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF900000F" edc:addr="0x42001808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="SDASETUP" edc:nzwidth="0x4" edc:desc="SDA Setup Time"/>
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="DATA32B" edc:nzwidth="0x1" edc:desc="Data 32 Bit"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FIFOEN" edc:nzwidth="0x1" edc:desc="FIFO Enable"/>
            <edc:SFRFieldDef edc:cname="RXTRHOLD" edc:nzwidth="0x2" edc:desc="Receive FIFO Threshold">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Interrupt and DMA triggers are generated when DATA is present in the FIFO" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Interrupt and DMA triggers are generated when FIFO is half-full" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="Interrupt and DMA triggers are generated when FIFO is full" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXTRHOLD" edc:nzwidth="0x2" edc:desc="Transmit FIFO Threshold">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Interrupt and DMA triggers are generated as long as the FIFO is not full" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Interrupt and DMA triggers are generated when half FIFO space is free" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EMPTY" edc:desc="Interrupt and DMA triggers are generated as long as the FIFO is not full" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
