Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM5164LS00064.PIC
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="CTRLC" edc:nzwidth="0x20" edc:access="nnnnn-nn-nnn--nn----nnnn-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFB730F07" edc:addr="0x42001808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="GTIME" edc:nzwidth="0x3" edc:desc="Guard Time"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BRKLEN" edc:nzwidth="0x2" edc:desc="LIN Master Break Length">
              <edc:SFRFieldSemantic edc:cname="13_BIT" edc:desc="Break field transmission is 13 bit times" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="17_BIT" edc:desc="Break field transmission is 17 bit times" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="21_BIT" edc:desc="Break field transmission is 21 bit times" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="26_BIT" edc:desc="Break field transmission is 26 bit times" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="HDRDLY" edc:nzwidth="0x2" edc:desc="LIN Master Header Delay">
              <edc:SFRFieldSemantic edc:cname="DELAY0" edc:desc="Delay between break and sync transmission is 1 bit time; Delay between sync and ID transmission is 1 bit time" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DELAY1" edc:desc="Delay between break and sync transmission is 4 bit time; Delay between sync and ID transmission is 4 bit time" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DELAY2" edc:desc="Delay between break and sync transmission is 8 bit time; Delay between sync and ID transmission is 4 bit time" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DELAY3" edc:desc="Delay between break and sync transmission is 14 bit time; Delay between sync and ID transmission is 4 bit time" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="INACK" edc:nzwidth="0x1" edc:desc="Inhibit Not Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DSNACK" edc:nzwidth="0x1" edc:desc="Disable Successive NACK"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MAXITER" edc:nzwidth="0x3" edc:desc="Maximum Iterations"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DATA32B" edc:nzwidth="0x2" edc:desc="Data 32 Bit">
              <edc:SFRFieldSemantic edc:cname="0x0" edc:desc="Reads and writes with CHSIZE" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="0x1" edc:desc="Reads with CHSIZE, writes with 32-bit extension" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="0x2" edc:desc="Reads with 32-bit extension, writes with CHSIZE" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="0x3" edc:desc="Reads and writes with 32-bit extension" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEN" edc:nzwidth="0x1" edc:desc="FIFO Enable"/>
            <edc:SFRFieldDef edc:cname="RXTRHOLD" edc:nzwidth="0x2" edc:desc="Receive FIFO Threshold">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Interrupt and DMA triggers are generated when DATA is present in the FIFO" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Interrupt and DMA triggers are generated when FIFO is half-full" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="Interrupt and DMA triggers are generated when FIFO is full" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXTRHOLD" edc:nzwidth="0x2" edc:desc="Transmit FIFO Threshold">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Interrupt and DMA triggers are generated as long as the FIFO is not full" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Interrupt and DMA triggers are generated when half FIFO space is free" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EMPTY" edc:desc="Interrupt and DMA triggers are generated when the FIFO is empty" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="BAUD" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:addr="0x4200180C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="BAUD" edc:nzwidth="0x10" edc:desc="Baud Rate Value"/>
            <edc:AdjustPoint edc:offset="-3"/>
            <edc:SFRFieldDef edc:cname="FP" edc:nzwidth="0x3" edc:desc="Fractional Part"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="RXPL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:addr="0x4200180E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="RXPL" edc:nzwidth="0x8" edc:desc="Receive Pulse Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="n-nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xBF" edc:addr="0x42001814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DRE" edc:nzwidth="0x1" edc:desc="Data Register Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:nzwidth="0x1" edc:desc="Transmit Complete Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:nzwidth="0x1" edc:desc="Receive Complete Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXS" edc:nzwidth="0x1" edc:desc="Receive Start Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:nzwidth="0x1" edc:desc="Clear To Send Input Change Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Break Received Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:nzwidth="0x1" edc:desc="Combined Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
